{
  "backend/main.mo": "Empty Motoko actor with no implemented logic.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, associated files, components, and metadata for the project.",
  "frontend-file-summaries.txt": "JSON-style mapping of frontend file paths to brief descriptions of their roles in the app.",
  "frontend/index.css": "Tailwind base/styles plus light/dark OKLCH design tokens and global typography/background settings.",
  "frontend/index.html": "HTML entry point loading Inter fonts, meta tags, manifest, and mounting the React app.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, theme colors, start behavior, and icons.",
  "frontend/src/App.tsx": "Main dashboard component wiring search, filters, CRUD, pagination, and layout elements within providers.",
  "frontend/src/components/credentials/BadgeMultiSelect.tsx": "Multi-select UI with badge chips, popover list, and checkbox-driven selection.",
  "frontend/src/components/credentials/CopyButton.tsx": "Copy-to-clipboard button with success/error toast feedback and temporary copied state icon.",
  "frontend/src/components/credentials/CredentialFilters.tsx": "Filter bar with category, range, and branch selectors plus individual and global clear actions.",
  "frontend/src/components/credentials/CredentialFormModal.tsx": "Modal form for adding or editing a credential with fields, validation, and password visibility toggle.",
  "frontend/src/components/credentials/CredentialSearchBar.tsx": "Search input component for filtering credentials by text query.",
  "frontend/src/components/credentials/CredentialTable.tsx": "Displays a table of credentials with badges, copy actions, password visibility, and edit/delete controls.",
  "frontend/src/components/credentials/DeleteCredentialConfirm.tsx": "Confirmation dialog for deleting a credential.",
  "frontend/src/components/credentials/EmptyState.tsx": "Empty-state UI prompting users to add their first credential.",
  "frontend/src/components/credentials/PaginationControls.tsx": "Pagination UI for navigating pages and selecting page size.",
  "frontend/src/components/credentials/PasswordCell.tsx": "Table cell component that toggles password visibility.",
  "frontend/src/components/dashboard/PageTitleBlock.tsx": "Header block showing the system title and subtitle.",
  "frontend/src/components/layout/FixedFooter.tsx": "Fixed footer displaying a confidentiality notice.",
  "frontend/src/components/layout/StickyHeader.tsx": "Sticky header with organization title, logo, and theme toggle.",
  "frontend/src/components/layout/ThemeToggle.tsx": "Button to switch between light and dark themes.",
  "frontend/src/components/print/PrintButton.tsx": "Button that triggers browser printing for credential data.",
  "frontend/src/constants/credentialOptions.ts": "Provides constant lists for category, range, and branch selection options.",
  "frontend/src/hooks/useActor.ts": "Hook for creating and managing a backend actor based on Internet Identity.",
  "frontend/src/hooks/useCredentialFiltering.ts": "Hook for searching and filtering credentials by query and category/range/branch filters.",
  "frontend/src/hooks/useCredentials.ts": "Hook managing credential CRUD operations with local storage persistence.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication using AuthClient, managing identity state, login flow, and error handling.",
  "frontend/src/hooks/usePagination.ts": "Implements a pagination hook that tracks page, page size, and returns paginated subsets of data.",
  "frontend/src/hooks/useTheme.ts": "Manages light/dark theme state with localStorage persistence and toggling via DOM class changes.",
  "frontend/src/index.css": "Defines Tailwind base styles, color variables, dark mode values, print styles, table styling, and custom utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/storage/credentialsStorage.ts": "Loads and saves credential records to localStorage with validation and error handling.",
  "frontend/src/types/credentials.ts": "Defines the Credential interface and form data type omitting auto-generated fields.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, fonts, plugins, and extended utilities for the project.",
  "project_state.json": "Stores project metadata, requirements, features, and architectural notes for the app’s current state."
}